---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterElementIdRule
source: html/13fdd3eb-20bb-6815-b0ad-b93c9e892b1c.htm
---
# FilterElementIdRule Properties

Specifies whether the .NET object represents a valid Revit entity.